In [9]:
import pandas as pd

In [10]:
pd.__version__

'2.2.2'

In [11]:
s1=pd.Series(['mahi',19,"27_7_2005",'b.tech cse','2024'],index=['name','age','DOB','STD','year'])

In [12]:
print(s1)

name          mahi
age             19
DOB      27_7_2005
STD     b.tech cse
year          2024
dtype: object

In [22]:
s2=pd.Series(['afsal',20,"2_2_2004",'b.tech cse','2024'],index=['name','age','DOB','STD','year'])

In [23]:
print(s2)

name         afsal
age             20
DOB       2_2_2004
STD     b.tech cse
year          2024
dtype: object

In [24]:
s3=pd.Series(['praveen','21','18-1-2003','b.tech cse','2023'], index=['name','age','DOB','STD','year'])

In [25]:
print(s3)

name       praveen
age             21
DOB      18-1-2003
STD     b.tech cse
year          2023
dtype: object

In [26]:
df1=pd.DataFrame(s2,columns=["details"])

In [27]:
df1

         details
name       afsal
age           20
DOB     2_2_2004
STD   b.tech cse
year        2024

In [28]:
df1["data"]=s3

In [29]:
df1

         details        data
name       afsal     praveen
age           20          21
DOB     2_2_2004   18-1-2003
STD   b.tech cse  b.tech cse
year        2024        2023

In [30]:
automobiles={"car":{1:"civic",2:"city",3:"swift",4:"dezire",5:"creata"},"bike":{1:"duke",2:"vespa",3:"xpulse",4:"himalaian",5:"parak"}}

In [31]:
df2=pd.DataFrame(automobiles,columns=["car","bike"])

In [32]:
df2

      car       bike
1   civic       duke
2    city      vespa
3   swift     xpulse
4  dezire  himalaian
5  creata      parak

In [33]:
details={"student1":{'name':'varun','reg no':'457','year of stu':'second year'},"student2":{'name':'arun','reg no':'458','year of stu':'second year'},"student3":{'name':'hari','reg no':'459','year of stu':'second year'},"student4":{'name':'afsal','reg no':'450','year of stu':'second year'},"student5":{'name':'guru','reg no':'451','year of stu':'second year'}}

In [34]:
df3=pd.DataFrame(details,columns=["student1","student2","student3","student4","student5"])

In [35]:
df3

                student1     student2     student3     student4     student5
name               varun         arun         hari        afsal         guru
reg no               457          458          459          450          451
year of stu  second year  second year  second year  second year  second year

In [36]:
car=df2["car"]

In [37]:
car

1     civic
2      city
3     swift
4    dezire
5    creata
Name: car, dtype: object

In [38]:
df2.drop("car",axis=1)

        bike
1       duke
2      vespa
3     xpulse
4  himalaian
5      parak